{
    "code": 1,
    "message": "Retrieved successfully",
    "announcements": 
    [
    {
       "id": 1,
       "title": "Νέα Λειτουργία",
       "message": "Προσθέσαμε ένα νέο πίνακα ελέγχου για καλύτερη παρακολούθηση των δεδομένων σας!",
       "date": "2025-07-05",
       "type": "info"
    },

    {
        "id": 2,
        "title": "Προγραμματισμένη Συντήρηση",
        "message": "Οι διακομιστές μας θα είναι εκτός λειτουργίας για συντήρηση στις 10 Ιουλίου από 01:00 έως 03:00μ.μ.",
        "date": "2025-07-04",
        "type": "warning"  
    },

    {
        "id": 3,
        "title": "Έκτακτο Δελτίο Καιρού",
        "message": "Αναμένονται έντονες βροχοπτώσεις και καταιγίδες στην περιοχή από το απόγευμα. Παρακαλούμε λάβετε τις απαραίτητες προφυλάξεις.",
        "date": "2025-07-05",
        "type": "alert"
    },

    {
        "id": 4,
        "title": "Εξέταση Διπλωματικής Εργασίας",
        "message": "Η εξέταση της διπλωματικής εργασίας του φοιτητή Ιωάννη Παπαδόπουλου με τίτλο «Ανάπτυξη Έξυπνου Συστήματος Παρακολούθησης Περιβάλλοντος» θα πραγματοποιηθεί την Τρίτη 9 Ιουλίου 2025 και ώρα 12:00 στην αίθουσα Β2.",
        "date": "2025-07-05",
        "type": "info"
    },
        
    {
        "id": 5,
        "title": "Ανάθεση Διπλωματικών Θεμάτων",
        "message": "Οι φοιτητές που ενδιαφέρονται να εκπονήσουν διπλωματική εργασία κατά το χειμερινό εξάμηνο 2025 καλούνται να δηλώσουν το θέμα και τον επιβλέποντα καθηγητή έως την Παρασκευή 19 Ιουλίου 2025, μέσω της ηλεκτρονικής πλατφόρμας του Τμήματος.",
        "date": "2025-07-05",
        "type": "info"
    },

    {
        "id": 6,
        "title": "Παρουσιάσεις Διπλωματικών Εργασιών",
        "message": "Οι παρουσιάσεις διπλωματικών εργασιών του εαρινού εξαμήνου θα πραγματοποιηθούν από 15 έως 19 Ιουλίου 2025. Το αναλυτικό πρόγραμμα θα αναρτηθεί εντός της εβδομάδας.",
        "date": "2025-07-06",
        "type": "info"
    },

    {
        "id": 7,
        "title": "Υποβολή Τελικής Έκδοσης Διπλωματικής",
        "message": "Οι φοιτητές που ολοκλήρωσαν τη διπλωματική τους εργασία οφείλουν να καταθέσουν την τελική έκδοση σε μορφή PDF έως τη Δευτέρα 22 Ιουλίου 2025 στην ηλεκτρονική πλατφόρμα του Τμήματος.",
        "date": "2025-07-06",
        "type": "warning"
    },

    {
        "id": 8,
        "title": "Εξέταση Διπλωματικής Εργασίας",
        "message": "Η εξέταση της διπλωματικής εργασίας της φοιτήτριας Μαρίας Καλογεροπούλου με τίτλο «Ανάλυση Δεδομένων Χρήσης σε Έξυπνες Πόλεις» θα πραγματοποιηθεί την Τετάρτη 10 Ιουλίου 2025 και ώρα 10:00 στην αίθουσα Α1.",
        "date": "2025-07-06",
        "type": "info"
    },

    {
        "id": 9,
        "title": "Εξέταση Διπλωματικής Εργασίας",
        "message": "Η εξέταση της διπλωματικής εργασίας του φοιτητή Νικολάου Αντωνίου με τίτλο «Σχεδίαση και Ανάπτυξη Εφαρμογής για Διαχείριση Ραντεβού» θα πραγματοποιηθεί την Πέμπτη 11 Ιουλίου 2025 και ώρα 14:00 στην αίθουσα Γ3.",
        "date": "2025-07-06",
        "type": "info"
    },

    {
        "id": 11,
        "title": "Εξέταση Διπλωματικής Εργασίας",
        "message": "Η εξέταση της διπλωματικής εργασίας της φοιτήτριας Ελένης Δημητροπούλου με τίτλο «Συστήματα Αναγνώρισης Προσώπου σε Περιβάλλον Web» θα πραγματοποιηθεί την Παρασκευή 12 Ιουλίου 2025 και ώρα 09:30 στην αίθουσα Β1.",
        "date": "2025-07-06",
        "type": "info"
    }
          
    ]
}